"use strict";

/*
Необходимо реализовать четыре функции, каждая функция должна принимать по два
числа и выполнять одну из операций (каждая функция выполняет одну из них):
1. Сложение
2. Разность
3. Умножение
4. Деление
Необходимо сделать так, чтобы функция вернула число, например выражение
console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция
сложения в данном примере, ваши названия функций могут отличаться).
Округлять значения, которые возвращают функции не нужно, однако, обратите
внимание на разность, функция должна вычесть из большего числа меньшее, либо
вернуть 0, если числа равны.
Функциям всегда передаются корректные числа, проверки на NaN, Infinity делать
не нужно.
Демонстрировать работы функций не обязательно.
*/

/**
 * Считает сумму переданных аргументов.
 * @param {number} a - Первое число.
 * @param {number} b - Второе число.
 * @return {number} Сумма чисел.
 */
function sum(a, b) {
  return a + b;
}

/**
 * Считает произведение переданных аргументов.
 * @param {number} a - Первое число.
 * @param {number} b - Второе число.
 * @return {number} Проиведение чисел.
 */
function prod(a, b) {
  return a * b;
}

/**
 * Считаем частное переданных аргументов.
 * @param {number} a - Первое число.
 * @param {number} b - Второе число.
 * @return {number} Частное чисел.
 */
function div(a, b) {
  return a / b;
}

/**
 * Считает разницу переданных аргументов.
 * @param {number} a - Первое число.
 * @param {number} b - Второе число.
 * @return {number} Разница чисел.
 */
function diff(a, b) {
  if (a > b) {
    return a - b;
  }
  return b - a;
}

console.log(sum(2, 6));
console.log(prod(15, 10));
console.log(div(12, 9).toFixed(2));
console.log(diff(20, 13));
console.log(diff(13, 20));
console.log(diff(13, 13));
